
        name: "GoogleNet"
        layer {
          name: "data"
          type: "Input"
          top: "data"
          input_param { shape: { dim: 1 dim: 3 dim: 224 dim: 224 } }
        }
        # ... rest of prototxt content
        